{
  "name": "Web Scraping",
  "url": "https://en.wikipedia.org/wiki/Brain_in_a_vat",
  "content": {
    "text": "In philosophy, the brain in a vat (BIV) is a scenario used in a variety of thought experiments intended to draw out certain features of human conceptions of knowledge, reality, truth, mind, consciousness, and meaning. It is a modern incarnation of René Descartes's evil demon thought experiment, originated by Gilbert Harman.&#91;1&#93; Found in many science fiction stories, it outlines a scenario in which a mad scientist, machine, or other entity might remove a person's brain from the body, suspend it in a vat of life-sustaining liquid, and connect its neurons by wires to a supercomputer that would provide it with electrical impulses identical to those a brain normally receives.&#91;2&#93; According to such stories, the computer would then be simulating reality (including appropriate responses to the brain's own output) and the \"disembodied\" brain would continue to have perfectly normal conscious experiences, such as those of a person with an embodied brain, without these being related to objects or events in the real world.\nThe simplest use of brain-in-a-vat scenarios is as an argument for philosophical skepticism&#91;3&#93; and solipsism. A simple version of this runs as follows: since the brain in a vat gives and receives exactly the same impulses as it would if it were in a skull, and since these are its only way of interacting with its environment, then it is not possible to tell, from the perspective of that brain, whether it is in a skull or a vat. Yet in the first case, most of the person's beliefs may be true (if they believe, say, that they are walking down the street, or eating ice-cream); in the latter case, their beliefs are false. Since the argument says if one cannot know whether one is a brain in a vat, then one cannot know whether most of one's beliefs might be completely false. Since, in principle, it is impossible to rule out oneself being a brain in a vat, there cannot be good grounds for believing any of the things one believes; a skeptical argument would contend that one certainly cannot know them, raising issues with the definition of knowledge. Other philosophers have drawn upon sensation and its relationship to meaning in order to question whether brains in vats are really deceived at all,&#91;4&#93; thus raising wider questions concerning perception, metaphysics, and the philosophy of language.\nThe brain-in-a-vat is a contemporary version of the argument given in HinduMaya illusion, Plato's Allegory of the Cave, Zhuangzi's \"Zhuangzi dreamed he was a butterfly\", and the evil demon in René Descartes' Meditations on First Philosophy.\nRecently, many contemporary philosophers believe that virtual reality will seriously affect human autonomy as a form of brain in a vat. But another view is that VR will not destroy our cognitive structure or take away our connection with reality. On the contrary, VR will allow us to have more new propositions, new insights and new perspectives to see the world.&#91;5&#93;While the disembodied brain (the brain in a vat) can be seen as a helpful thought experiment, there are several philosophical debates surrounding the plausibility of the thought experiment. If these debates conclude that the thought experiment is implausible, a possible consequence would be that we are no closer to knowledge, truth, consciousness, representation, etc. than we were prior to the experiment.\nOne argument against the BIV thought experiment derives from the idea that the BIV is not – and cannot be – biologically similar to that of an embodied brain (that is, a brain found in a person). Since the BIV is dis embodied, it follows that it does not have similar biology to that of an embodied brain. That is, the BIV lacks the connections from the body to the brain, which renders the BIV neither neuroanatomically nor neurophysiologically similar to that of an embodied brain.&#91;6&#93;&#91;7&#93; If this is the case, we cannot say that it is even possible for the BIV to have similar experiences to the embodied brain, since the brains are not equal. However, it could be counter-argued that the hypothetical machine could be made to also replicate those types of inputs.\nA second argument deals directly with the stimuli coming into the brain. This is often referred to as the account from externalism or ultra-externalism.&#91;8&#93; In the BIV, the brain receives stimuli from a machine. In an embodied brain, however, the brain receives the stimuli from the sensors found in the body (via touching, tasting, smelling, etc.) which receive their input from the external environment. This argument oftentimes leads to the conclusion that there is a difference between what the BIV is representing and what the embodied brain is representing. This debate has been hashed out, but remains unresolved, by several philosophers including Uriah Kriegel,&#91;9&#93;Colin McGinn,&#91;10&#93; and Robert D. Rupert,&#91;11&#93; and has ramifications for philosophy of mind discussions on (but not limited to) representation, consciousness, content, cognition, and embodied cognition.&#91;12&#93;A third argument against BIV comes from a direction of incoherence, which was presented by the philosopher Hilary Putnam. He attempts to demonstrate this through the usage of a transcendental argument, in which he tries to illustrate that the thought experiment's incoherence lies on the basis that it is self-refuting.&#91;13&#93; To do this, Putnam first established a relationship that he refers to as a \"causal connection\" which is sometimes referred to as \"a causal constraint\".&#91;14&#93;&#91;2&#93; This relationship is further defined, through a theory of reference that suggested reference can not be assumed, and words are not automatically intrinsically connected with what it represents. This theory of reference would later become known as semantic externalism. This concept is further illustrated when Putnam establishes a scenario in which a monkey types out Hamlet by chance; however, this does not mean that the monkey is referring to the play due to the fact that the monkey has no knowledge of Hamlet and therefore can not refer back to it.&#91;15&#93; He then offers the \"Twin Earth\" example to demonstrate that two identical individuals, one on our earth and another on a \"twin earth\", may possess the exact same mental state and thoughts, yet refer to two different things.&#91;16&#93; For instance, when we think of cats, the referent of our thoughts would be the cats that we find here on earth. However, our twins on twin earth, though possessing the same thoughts, would instead be referring not to our cats, but to twin earth's cats. Bearing this in mind, he writes that a \"pure\" brain in a vat, i.e., one that has never existed outside of the simulation, could not even truthfully say that it was a brain in a vat. This is because the BIV, when it says \"brain\" and \"vat\", can only refer to objects within the simulation, not to things outside the simulation it does not have a relationship with. Putnam refers to this relationship as a \"causal connection\" which is sometimes referred to as \"a causal constraint\".&#91;14&#93;&#91;2&#93; Therefore, what it says is demonstrably false. Alternatively, if the speaker is not actually a BIV, then the statement is also false. He concludes, then, that the statement \"I'm a BIV\" is necessarily false and self-refuting.&#91;16&#93; This argument has been explored at length in philosophical literature since its publication. One counter-argument says that, even assuming Putnam's reference theory, a brain on our earth that is \"kidnapped\", placed into a vat, and subjected to a simulation could still refer to \"real\" brains and vats, and thus correctly say it is a brain in a vat.&#91;17&#93; However, the notion that the \"pure\" BIV is incorrect and the reference theory underpinning it remains influential in the philosophy of mind, language and metaphysics.&#91;18&#93;&#91;19&#93;An issue that has arisen with Putnam's argument is that even if the premises he laid out is assumed to be true, the only proven fact is that when a brain in a vat states 'I am a BIV' it would be false due to the causal theory of reference.&#91;20&#93; This does not necessarily provide proof that we are not brains in vats, rather it is an argument that is primarily focused on externalist semantics.&#91;21&#93; In order to combat this issue, various philosophers have taken on the task of reconstructing Putnam's argument. Some philosophers like Anthony L. Brueckner and Crispin Wright have taken on approaches that utilize disquotational principles.&#91;20&#93;&#91;14&#93; While others like Ted A. Warfield have taken on approaches that focus on the concepts of self-knowledge and priori.&#91;21&#93;One of the earliest but influential reconstructions of Putnam's transcendental argument was suggested by Anthony L. Brueckner. Brueckner's reconstruction is as follows: \"(1) Either I am a BIV (speaking vat-English) or I am a non-BIV (speak- ing English). (2) If I am a BIV (speaking vat-English), then my utterances of 'I am a BIV' are true if I have sense impressions as of being a BIV. (3) If I am a BIV (speaking vat-English), then I do not have sense impressions as of being a BIV. (4) If I am a BIV (speaking vat-English), then my utterances of 'I am a BIV' are false. [(2), (3)] (5) If I am a non-BIV (speaking English), then my utterances of 'I am a BIV' are true if I am a BIV. (6) If I am a non-BIV (speaking English), then my utterances of 'I am a BIV' are false. [(5)] (7) My utterances of 'I am a BIV' are false. [(1), (4), (6)]\"&#91;20&#93; A key thing to note is that although these premises further define Putnam's argument, it does not in fact prove ' I am not a BIV', due to the fact that although the premises do lay out the idea that 'I am a BIV' is false, it does not necessarily provide any basis on which false statement the speaker is making. There is no differentiation between the BIV making the statement versus a non-BIV making the statement. Therefore, Brueckner further strengthens his argument by adding a disquotational principle of \"My utterances of ‘I am not a BIV’ are true if I am not a BIV.\"&#91;20&#93;"
  }
}